app/controllers/api/v1/authentication_controller.rb

  def login
    @user = User.find_by_email(params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "gourav8@gmail.com"], ["LIMIT", 1]]

  def forgot_password

    @user = User.find_by_email(params[:email])
    if @user
      @user.update(password: params[:password], password_confirmation: params[:password_confirmation])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "gourav9@gmail.com"], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "[FILTERED]"], ["updated_at", "2024-03-11 06:58:55.204450"], ["id", 11]]