app/controllers/api/v1/comments_controller.rb

SELECT "comments".* FROM "comments"
SELECT 1 AS one FROM "comments" LIMIT ?  [["LIMIT", 1]]
---
  def index
    @comments = Comment.all

    if @comments.present?

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @comment = Comment.find_by(id:params[:id])

INSERT INTO "comments" ("user_id", "comment_title", "comment_body", "comment_movie_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["user_id", 3], ["comment_title", "anythings"], ["comment_body", "nothings"], ["comment_movie_id", "2"], ["created_at", "2024-03-11 11:33:18.927262"], ["updated_at", "2024-03-11 11:33:18.927262"]]
---
  def create
    @comment = Comment.new(comment_params)
    if @comment.save

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "comments" SET "comment_title" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["comment_title", "nhi pta"], ["updated_at", "2024-03-11 11:40:04.765875"], ["id", 1]]
---
  def update
    @comment = Comment.find_by(id: params[:id])
    if @comment
      if @comment.update(comment_params)

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]
---
  def destroy
    @comment = Comment.find_by(id: params[:id])
    if @comment
      if @comment.destroy