app/controllers/api/v1/ratings_controller.rb

  def index
    @ratings = Rating.all
    if @ratings.present?
---
SELECT "ratings".* FROM "ratings"

  def show
    @rating = Rating.find_by(id:params[:id])
---
SELECT "ratings".* FROM "ratings" WHERE "ratings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @rating = Rating.new(rating_params)
    if @rating.save
---
INSERT INTO "ratings" ("user_id", "rating_value", "rating_movie_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["user_id", 13], ["rating_value", 7.5], ["rating_movie_id", "5"], ["created_at", "2024-03-19 09:26:07.472487"], ["updated_at", "2024-03-19 09:26:07.472487"]]

  def update
    @rating = Rating.find_by(id: params[:id])
    if @rating.present?
      if @rating.update(rating_params)
---
SELECT "ratings".* FROM "ratings" WHERE "ratings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "ratings" SET "rating_value" = ?, "rating_movie_id" = ?, "updated_at" = ? WHERE "ratings"."id" = ?  [["rating_value", 9.5], ["rating_movie_id", "8"], ["updated_at", "2024-03-19 09:28:56.969598"], ["id", 1]]

  def destroy
    @rating = Rating.find_by(id: params[:id])
    if @rating
      if @rating.destroy
---
SELECT "ratings".* FROM "ratings" WHERE "ratings"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "ratings" WHERE "ratings"."id" = ?  [["id", 2]]