app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("firstname", "lastname", "username", "twofa", "twofa_on_off", "created_at", "updated_at", "email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "users" SET "firstname" = ?, "lastname" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["firstname", "rahul"], ["lastname", "sharma"], ["updated_at", "2024-03-14 07:06:31.558897"], ["id", 2]]
---
  def update
    @user = User.find_by(id: params[:id])
    if @user
      if @user.update(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 10]]
---
  def destroy
    @user = User.find(params[:id])
    if @user.destroy