app/controllers/api/v1/watchlaters_controller.rb

SELECT "watchlaters".* FROM "watchlaters"
---
  def index
    @watchlaters = Watchlater.all

INSERT INTO "watchlaters" ("user_id", "watchlater_movie_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["user_id", 5], ["watchlater_movie_id", "9"], ["created_at", "2024-03-12 10:22:53.225550"], ["updated_at", "2024-03-12 10:22:53.225550"]]
---
  def create
    @watchlater = Watchlater.new(watchlater_params)
    if @watchlater.save

SELECT "watchlaters".* FROM "watchlaters" WHERE "watchlaters"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "watchlaters" SET "watchlater_movie_id" = ?, "updated_at" = ? WHERE "watchlaters"."id" = ?  [["watchlater_movie_id", "12"], ["updated_at", "2024-03-12 10:31:36.267416"], ["id", 2]]
---
  def update
    @watchlater = Watchlater.find(params[:id])
    if @watchlater.update(watchlater_params)

SELECT "watchlaters".* FROM "watchlaters" WHERE "watchlaters"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "watchlaters" WHERE "watchlaters"."id" = ?  [["id", 1]]
---
  def destroy
    @watchlater = Watchlater.find(params[:id])
    if @watchlater.destroy