app/controllers/api/v1/watchlists_controller.rb

  def index
    @watchlists = Watchlist.all
    if @watchlists.present?
---
SELECT "watchlists".* FROM "watchlists"

  def show
    @watchlist = Watchlist.find_by(id: params[:id])
---
SELECT "watchlists".* FROM "watchlists" WHERE "watchlists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @watchlist = Watchlist.new(watchlist_params)
    if @watchlist.save
---
INSERT INTO "watchlists" ("user_id", "watchlist_movie_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["user_id", 2], ["watchlist_movie_id", "3"], ["created_at", "2024-03-12 07:36:46.784002"], ["updated_at", "2024-03-12 07:36:46.784002"]]

  def update
    @watchlist = Watchlist.find_by(id: params[:id])
    if @watchlist.present?
      if @watchlist.update(watchlist_params)
---
SELECT "watchlists".* FROM "watchlists" WHERE "watchlists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "watchlists" SET "user_id" = ?, "updated_at" = ? WHERE "watchlists"."id" = ?  [["user_id", 3], ["updated_at", "2024-03-12 09:02:37.061068"], ["id", 1]]

  def destroy
    @watchlist = Watchlist.find_by(id: params[:id])
    if @watchlist
      if @watchlist.destroy
---
SELECT "watchlists".* FROM "watchlists" WHERE "watchlists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "watchlists" WHERE "watchlists"."id" = ?  [["id", 1]]